espressif2022/ESP_HMI_demo/perf_benchmark/sdkconfig.ci.perf_esp32s3
CONFIG_IDF_TARGET="esp32s3"
# For IDF 5.0
CONFIG_ESP_TASK_WDT_EN=n

CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_FREERTOS_HZ=1000
CONFIG_MMAP_FILE_SUPPORT_FORMAT=".jpg,.png,.ttf,.qoi"
CONFIG_LV_COLOR_16_SWAP=y
CONFIG_LV_MEM_SIZE_KILOBYTES=128
CONFIG_LV_MEM_BUF_MAX_NUM=10
CONFIG_LV_USE_FS_POSIX=y
CONFIG_LV_FS_POSIX_LETTER=67
CONFIG_LV_USE_PNG=y
CONFIG_LV_USE_SJPG=y
